src/Enums/ВидОперацииДокумента/ВидОперацииДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДокумента</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доходы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасхода</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/ОбщийМодульСервер_ОперацииУчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль сервер: операции учёта.
// Создание и проведение документов доходов и расходов.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создаёт и проводит документ операции синхронно.
// Параметры операции должны быть заранее проверены на клиенте; на сервере выполняется повторная проверка.
//
Процедура СоздатьИПровестиОперацию(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента) Экспорт
	
	ПроверитьДанныеОперации(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента);
	СоздатьДокументДвижения(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента);
	
КонецПроцедуры

// Проверяет обязательные реквизиты операции учёта.
// При ошибке вызывает исключение с текстом для пользователя.
//
Процедура ПроверитьДанныеОперации(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		
		ВызватьИсключение "Не заполнена дата операции.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		
		ВызватьИсключение "Не указан вид операции.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		
		ВызватьИсключение "Не заполнена категория.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		
		ВызватьИсключение "Не заполнен счет.";
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		
		ВызватьИсключение "Не заполнена валюта.";
		
	КонецЕсли;
	
	Если СуммаДокумента <= 0 Тогда
		
		ВызватьИсключение "Сумма операции должна быть больше нуля.";
		
	КонецЕсли;
	
	ОбщийМодульСервер_КурсыВалют.ПроверитьНаличиеКурса(Валюта, ДатаДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт документ Доходы или Расход и записывает его с проведением.
//
Процедура СоздатьДокументДвижения(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента)
	
	Если ВидОперации = Перечисления.ВидОперацииДокумента.Приход Тогда
		
		ДокПриход = Документы.Доходы.СоздатьДокумент();
		ДокПриход.Дата = ДатаДокумента;
		ДокПриход.КатегорияДоходов = Категория;
		ДокПриход.Счет = Счет;
		ДокПриход.Валюта = Валюта;
		ДокПриход.Сумма = СуммаДокумента;
		ДокПриход.Записать(РежимЗаписиДокумента.Проведение);
		
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДокумента.Расход Тогда
		
		ДокРасход = Документы.Расход.СоздатьДокумент();
		ДокРасход.Дата = ДатаДокумента;
		ДокРасход.КатегорияРасхода = Категория;
		ДокРасход.Счет = Счет;
		ДокРасход.Валюта = Валюта;
		ДокРасход.Сумма = СуммаДокумента;
		ДокРасход.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		ВызватьИсключение "Неизвестный вид операции.";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
